import React from 'react'

function Poem() {
  return (
    <div className="flex flex-col gap-4 items-center justify-center min-h-screen w-full px-4 py-20">
      <h1 className="text-5xl md:text-6xl font-bold pb-4">I love you &#x1F600;</h1>
      <div className="text-lg max-w-md leading-9 space-y-4">
        <p>
          Ти – світло, що в серці моєму горить,<br />
          Ти сенс у житті, що не можна згубить.<br />
          Я дихаю тобою, живу для тебе,<br />
          І навіть у снах я шукаю тебе.
        </p>
        <p>
          Ми разом пізнали, що значить життя,<br />
          Без теплих підказок і затишку дня.<br />
          Квартира маленька – любов у ній справжня,<br />
          Бо ми – це історія, сильна й відважна.
        </p>
        <p>
          Вечори із суші, з фільмами вдвох,<br />
          Де сміх наш лунає, де щастя – без строк.<br />
          Прогулянки Києвом – наше кіно,<br />
          Де кожна вуличка пам’ятає давно,<br />
          Як ми дуркували, як просто жили,<br />
          Як світом удвох цей кайф розділили.
        </p>
        <p>
          Я сумую, коли між нами міста,<br />
          Коли розлука стискає вуста.<br />
          Але знаю, що серце не знає меж,<br />
          Бо любов моя – в кожному дні, де ти є.
        </p>
        <p>
          І хай цей світ змінюється щодня,<br />
          Та ти для мене — вічна і єдина.<br />
          Немає місця кращого, ніж там,<br />
          Де наші серця б’ються разом, єдино.
        </p>
        <div className="flex flex-col items-end font-bold">
          <p>З любов&apos;ю,</p>
          <p>Твій коханий</p>
        </div>
      </div>
    </div>
  )
}

export default Poem